{
  "projects": [
    {
      "path": "prq",
      "side": "right",
      "url": "https://ecovadis-survey.com/register/account-details/",
      "data": {
        "title": "Ecovadis Portal",
        "role": "Front-end Developer",
        "description": "Registration application for Ecovadis Portal. Allow customers to create own account for their business.",
        "responsibilities": "Creating user interface components of application in React. Communication between components with shared state of application.",
        "techs": "JavaScript, React, Redux, Redux observable, Flow.js, Webpack, JSX, Styled Components, SASS"
      }
    },
    {
      "path": "bik_portal",
      "side": "left",
      "url": "https://nowekonto.bik.pl/login",
      "data": {
        "title": "BIK Portal",
        "role": "Front-end Developer",
        "description": "BIK Portal needed to be aware of your financial situation, evaluate your chances for a credit or view your credit history.",
        "responsibilities": "Developing front-end layer of BIK Portal. Implementing communication between front-end and back-end with REST API. Creating a Responsive Web Design for every page in application.",
        "techs": "AngularJS, JavaScript, Gulp, HTML5, SASS, Bootstrap"
      }
    },
    {
      "path": "one_web",
      "side": "right",
      "url": "https://www.allianz.pl/dla-ciebie/",
      "data": {
        "title": "Commercial CMS",
        "role": "Front-end Developer",
        "description": "UI components for internal commercial CMS. All internal product and web-sites of big European insurance company should have the same style and structure. Therefore all web-sites were built on components of this CMS.",
        "responsibilities": "Building components of huge commercial CMS. Implementing components to the existing system, bug fixing and support.",
        "techs": "JavaScript, AngularJS, jQuery, JSON, Freemarker template, LESS, Flex"
      }
    },
    {
      "path": "contact_us",
      "side": "left",
      "url": "https://www.allianz.pl/kontakt-z-allianz/?partner=SNA010",
      "data": {
        "title": "Contact us",
        "role": "Front-end Developer",
        "description": "Contact us it is single page application that allow customers to contact with their insurance agents and inform about troubles.",
        "responsibilities": "Building UI of application. Communication between front-end and back-end with REST API.",
        "techs": "AngularJS, JavaScript, Gulp, HTML5, LESS, Flex, JSON"
      }
    },
    {
      "path": "flex_mix",
      "side": "right",
      "url": "http://daniilsydorenko.github.io/flex-mix/",
      "data": {
        "title": "Flex-mix",
        "role": "Creator, Front-end Developer",
        "description": "Flex-mix has all needed functionality for building web application from scratch. It is my own solution for front-end development. It`s sass based boilerplate with grid system that based on flex technology. Sass structure is based on 7-1 architecture pattern(https://github.com/HugoGiraudel/sass-boilerplate). Responsive grid is based on Flexbox Grid(http://flexboxgrid.com/). Automation tools: Gulp. Other libraries: jQuery 2.2.3, Wow.js, modernizr.",
        "responsibilities": "Whole project creation. GitHub repository, documents, whole development",
        "techs": "JavaScript, HTML5, SASS, Flex, Gulp, NPM, Bower"
      }
    },
    {
      "path": "i_sport",
      "side": "left",
      "url": "https://i-sport.pl/",
      "data": {
        "title": "I-sport",
        "role": "Front-end Developer",
        "description": "Workouts programs designed by the coaches in Poland. Each workout contains videos about and comments. User can get a coach just for himself, which will support the implementation of his training or create an individual diet tailored to his activity. Also user can keep track of training and execute training plan in the framework of the 5 sport disciplines.",
        "responsibilities": "Converting PSD to HTML&CSS, responsive web design",
        "techs": "ASP.NET Razor, Bootstrap, JavaScript, jQuery"
      }
    },
    {
      "path": "folklor",
      "side": "right",
      "url": "http://www.zajazdfolklor.pl/",
      "data": {
        "title": "Zajazd Folklor",
        "role": "Front-end Developer",
        "description": "Website for hotel Zajazd Folklor. Information and photos about all the services provided by the hotel and apartment reservation",
        "responsibilities": "Creating new sections for the web-site based on Angular(with new controllers, routing, etc.). Implementing of new graphical elements",
        "techs": "AngularJS, jQuery, HTML5, CSS3"
      }
    },
    {
      "path": "zszywka",
      "side": "left",
      "url": "http://zszywka.pl/",
      "data": {
        "title": "Zszywka",
        "role": "Full-stack Developer",
        "description": "Zszywka is a graphic social network, where you can find an inspiring image on any topic, meet new people, promote own products. Zszywka allows to store all images one place, create shared publics and share an inspiration with other users.",
        "responsibilities": "Development of administration panel tools for viewing statistics reports, complaints from users, etc. Creation of functionality \"promo post\", which allows users to keep their posted content in the top of related category. Creation of public (shared group) for shared content. Implementation of new UI components",
        "techs": "PHP5, MySQL, Smarty, HTML5, CSS3, JavaScript, jQuery"
      }
    }
  ],
  "skills": [
    {
      "path": "back_end",
      "skillHeader": "Back-end",
      "skillIcon": "icon icon-tools-2",
      "skillSubHeader": "PHP, MySQL, Node.js",
      "skillText": "MVC, PHP OOP, Laravel, Symfony, Codeigniter, Doctrine, PDO, Wordpress",
      "duration": "0.3s",
      "delay": "0.2s"
    },
    {
      "path": "front_end",
      "skillHeader": "Front-end",
      "skillIcon": "icon icon-mobile",
      "skillSubHeader": "JavaScript, SASS, LESS",
      "skillText": "Standards ES5 and ES6, Typescript, Angular, jQuery, AJAX, Bootstrap, Flex",
      "duration": "0.4s",
      "delay": "0.3s"
    },
    {
      "path": "aut_tools",
      "skillHeader": "Automation tools",
      "skillIcon": "icon icon-gears",
      "skillSubHeader": "GULP, NPM, Composer",
      "skillText": "Bower, WebPack, Babel, Files minification, BrowserSync",
      "duration": "0.5s",
      "delay": "0.4s"
    },
    {
      "path": "usability",
      "skillHeader": "Usability",
      "skillIcon": "icon icon-tools",
      "skillSubHeader": "Mobile first approach",
      "skillText": "Responsive Web Design, Cross-browser compatibility, Media queries",
      "duration": "0.6s",
      "delay": "0.5s"
    },
    {
      "path": "browser_tools",
      "skillHeader": "Browser DevTools",
      "skillIcon": "icon icon-browser",
      "skillSubHeader": "Firefox, Chrome, IE10",
      "skillText": "Element inspecting, Network, Debugging, Local Storage, Sources",
      "duration": "0.7s",
      "delay": "0.6s"
    },
    {
      "path": "version_control",
      "skillHeader": "Version  Control",
      "skillIcon": "icon icon-linegraph",
      "skillSubHeader": "GIT, SVN",
      "skillText": "GitHub, GitHub Pages, Git Bash, Git features, Tortoise SVN, Gerrit",
      "duration": "0.8s",
      "delay": "0.7s"
    }
  ],
  "timeline": [
    {
      "iconClass": "vcard",
      "title": "EcoVadis",
      "url": "http://www.ecovadis.com/",
      "position": "Front-end JavaScript Developer",
      "responsibilities": "Developing single page application based on React & Redux. Building the UI components (desktop and mobile) with React(JSX), SASS. Creating tests for React components with Enzyme. Being a part of the team located in Warsaw, Paris, Tunis using Scrum.",
      "date": "09.2017 - 11.2017"
    },
    {
      "iconClass": "vcard",
      "title": "Primaris",
      "url": "http://primaris.eu/",
      "position": "Front-end JavaScript Developer",
      "responsibilities": "Making a front-end for web applications based on plain JavaScript, Typescript, AngularJS. REST communication between front-end and back-end. Building systems involving Gulp and Webpack. Creating responsive web design for mobile devices. Designing components for insurance company commercial CMS. Code refactoring and fixes for systems based on PHP.",
      "date": "07.2015 - 08.2017"
    },
    {
      "iconClass": "vcard",
      "title": "Profit Network",
      "url": "http://www.profitnetwork.pl/",
      "position": "PHP Web Developer",
      "responsibilities": "Building back-end and front-end of administration panel for website Tapon.pl. Creating from scratch and development of database, back-end and front-end for commercial squash league in Warsaw. Developing single page applications based on commercial PHP Framework, plain JavaScript and Bootstrap. Building of front-end for Tapon.pl Facebook application.",
      "date": "08.2014 - 06.2015"
    },
    {
      "iconClass": "vcard",
      "title": "Szafa.pl",
      "url": "http://grupaszafa.pl/",
      "position": "PHP Web Developer",
      "responsibilities": "Building administration panel tools for viewing statistics reports and content editing for the graphical social network Zszywka.pl. Developing functionality of 'promo post', which allows users to keep their posts in the top of the related category. Creating back-end and front-end of users groups that allows to share content between members. Implementation of new graphical components in Zszywka.pl design (buttons, labels, fonts, logos, etc.).",
      "date": "03.2014 - 07.2014"
    },
    {
      "iconClass": "vcard",
      "title": "Ideo",
      "url": "http://www.ideo.pl/",
      "position": "Intern / PHP Web Developer",
      "responsibilities": "Converting PSD templates to the HTML and CSS. Implementing a new simple components for pages based to the internal CMS.",
      "date": "11.2013 - 01.2014"
    },
    {
      "iconClass": "graduation-cap",
      "title": "University of Information Technology and Management",
      "url": "http://kandydaci.wsiz.rzeszow.pl/en/lang.html",
      "position": "Journalism and Social Communication. Master's degree.",
      "date": "2012 - 2014"
    },
    {
      "iconClass": "graduation-cap",
      "title": "Kharkiv National University of Radioelectronics",
      "url": "http://nure.ua/en/",
      "position": "Automation and Computer Integrated Technologies. Bachelor's degree.",
      "date": "2008 - 2012"
    }
  ]
}
